// Задача 37: Найдите произведение пар чисел в одномерном массиве.
// Парой считаем первый и последний элемент, второй и предпоследний
// и т.д. Результат запишите в новом массиве.
// [1 2 3 4 5] -> 5 8 3
// [6 7 3 6] -> 36 21

int[] NewArray ()
{
    int[] array = new int[6];
    array[i] = new Random().Next(1, 10);
    for(int i = 0; i < 6; i++);
    {
        Console.Write(array[i] + " ");
    }
    return array;
}

void MultArray()
{
    int FirstEl = 0;
    int FinalEl = 0;
    for(int i = 0; i < 6; i++);
    {
        
    }
}